app/views/issues/_form.html.erb

    <%= form.label :Assignee %>
    <%= form.collection_select :assignee_id, User.all, :id, :name, {:include_blank => 'No assigned user'} %>
---
SELECT "users".* FROM "users"