app/views/issues/show.html.erb

  <div>
    <p><strong> <%= User.find(@issue.user_id).name %> </strong> created an issue <small><font color="gray"><%= time_ago_in_words(@issue.created_at) + " ago" %></font></small></p>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

      <div class="col-md-8">
        <h2>Comentarios (<%= @issue.comments.count %>)</h2>

        <% @issue.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."issue_id" = ? ORDER BY "comments"."created_at" ASC  [["issue_id", 10]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."issue_id" = ?  [["issue_id", 39]]
SELECT "comments".* FROM "comments" WHERE "comments"."issue_id" = ? ORDER BY "comments"."created_at" ASC  [["issue_id", 39]]

            <p class="comenter">
              <%= User.find(comment.user_id).name %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

            <p> <% if comment.user_id == current_user.id%>
                <%= link_to 'Delete ', [Issue.find(comment.issue_id), comment],
                            method: :delete,
                            data: { confirm: 'Are you sure?' } , class: "destroy" %> .
              <% end %>
---
SELECT "issues".* FROM "issues" WHERE "issues"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]

        <% if !@issue.assignee_id.nil? %>
          <td class = "link-list"><%= link_to User.find(request.query_parameters[:id]=@issue.assignee_id).name, issues_url(assignee_id: @issue.assignee_id), class:"btn-link" %><td>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

        <td  class = "label-list">Votes</td>
        <td class = link-list> <%= @issue.votes.size %>
          <% if !Vote.exists?(:issue_id => @issue.id, :user_id => current_user.id) %>
---
SELECT COUNT(*) FROM "votes" WHERE "votes"."issue_id" = ?  [["issue_id", 39]]
SELECT 1 AS one FROM "votes" WHERE "votes"."issue_id" = ? AND "votes"."user_id" = ? LIMIT ?  [["issue_id", 39], ["user_id", 1], ["LIMIT", 1]]

        <td class = link-list><%= @issue.Watchers %>
          <% if !Watcher.exists?(:issue_id => @issue.id, :user_id => current_user.id) %>
---
SELECT 1 AS one FROM "watchers" WHERE "watchers"."issue_id" = ? AND "watchers"."user_id" = ? LIMIT ?  [["issue_id", 39], ["user_id", 1], ["LIMIT", 1]]