app/controllers/application_controller.rb

  def set_current_user
  	if User.find(1)
     @user = User.find(1)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]