app/controllers/issues_controller.rb

  def index
    @issues = Issue.all.order(sort_column + ' ' + sort_direction)
    @issues = @issues.where(Type: params[:Type]) if params[:Type]
    @issues = @issues.where(Priority: params[:Priority]) if params[:Priority]
    @issues = @issues.where(Status: params[:Status]) if params[:Status]


    respond_to do |format|

      if params.has_key?(:assignee_id)
        if User.exists?(id: params[:assignee_id])
          @issues = @issues.where(assignee_id: params[:assignee_id])
---
SELECT "issues".* FROM "issues" WHERE "issues"."Type" = ?  [["Type", "Bug"]]
SELECT "issues".* FROM "issues" WHERE "issues"."Priority" = ?  [["Priority", "Minor"]]
SELECT "issues".* FROM "issues" WHERE "issues"."Status" = ? ORDER BY "issues"."created_at" DESC  [["Status", "Open"]]
SELECT "issues".* FROM "issues" WHERE "issues"."assignee_id" = ?  [["assignee_id", 1]]

      end

      if params.has_key?(:watcher)
        if User.exists?(id: params[:watcher])
---
SELECT 1 AS one FROM "watchers" WHERE "watchers"."issue_id" = ? AND "watchers"."user_id" = ? LIMIT ?  [["issue_id", 10], ["user_id", 1], ["LIMIT", 1]]

  def create
    @issue = Issue.new(issue_params)
    @issue.user_id = current_user.id
    respond_to do |format|
      if @issue.save
---
INSERT INTO "issues" ("Title", "Description", "Type", "Priority", "Status", "assignee_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @issue.update(issue_params)
---
UPDATE "issues" SET "Status" = ?, "updated_at" = ? WHERE "issues"."id" = ?  [["Status", "New"], ["updated_at", "2019-12-05 01:30:47.446218"], ["id", 38]]

  def update_status
    respond_to do |format|
      @issue_to_update = Issue.find(params[:id])
---
SELECT "issues".* FROM "issues" WHERE "issues"."id" = ? ORDER BY "issues"."created_at" DESC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @issue.destroy
---
DELETE FROM "issues" WHERE "issues"."id" = ?  [["id", 13]]

    def set_issue
      @issue = Issue.find_by(id: params[:id])
---
SELECT "issues".* FROM "issues" WHERE "issues"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]